## Staging: ssm
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                 |
|--------|-------------------------------------|
| add    | `aws_ssm_parameter.saas_app_config` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.saas_app_config will be created
  + resource "aws_ssm_parameter" "saas_app_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "saas_app_config"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - postgres_password_arn   = "arn:aws:ssm:ca-central-1:394954348146:parameter/saas_procurement/db_password" -> null
  - postgres_password_value = (sensitive value)
  + saas_app_config_arn     = (known after apply)
  + saas_app_config_value   = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
